Repository: RockxyApp/Rockxy
Catalog: Rockxy/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Choose a proxy-aware Flutter client
zh_hans: 选择支持代理的 Flutter 客户端

source: Choose a regular JSON file.
zh_hans: 选择一个常规 JSON 文件。

source: Choose an app or host to preview what will be added.
zh_hans: 选择一个应用或主机以预览将添加的内容。

source: Choose an available directory to continue.
zh_hans: 请选择一个可用目录以继续。

source: Choose an item from the queue to inspect and edit its message.
zh_hans: 从队列中选择一个项目，以检查并编辑其消息。

source: Choose Application
zh_hans: 选择应用程序

source: Choose Captured Domain
zh_hans: 选择已捕获域名

source: Choose Captured Path
zh_hans: 选择捕获路径

source: Choose Certificate PEM or DER
zh_hans: 选择 PEM 或 DER 证书

source: Choose Domain to Mute
zh_hans: 选择要静音的域名

source: Choose Excluded Domain
zh_hans: 选择排除的域名

source: Choose Excluded Path
zh_hans: 选择排除的路径

source: Choose File and Replace…
zh_hans: 选择文件并替换…

source: Choose File…
zh_hans: 选择文件…

source: Choose local analysis or the app-wide AI model
zh_hans: 选择本地分析或应用范围的 AI 模型

source: Choose Ollama Install Location
zh_hans: 选择 Ollama 安装位置

source: Choose P12 Certificate
zh_hans: 选择 P12 证书

source: Choose Path Prefix to Mute
zh_hans: 选择要静音的路径前缀

source: Choose Private Key PEM or DER
zh_hans: 选择私钥 PEM 或 DER

source: Choose the command or environment example that matches how you run cURL.
zh_hans: 选择与你运行 cURL 方式匹配的命令或环境示例。

source: Choose the Flutter client path you use, then keep the iOS or Android device setup aligned with that runtime.
zh_hans: 选择你使用的 Flutter 客户端路径，然后使 iOS 或 Android 设备设置与该运行时保持一致。

source: Choose the Go HTTP client that matches your runtime and copy the snippet.
zh_hans: 选择与你的运行时匹配的 Go HTTP 客户端，然后复制代码片段。

source: Choose the Node.js library that matches your current runtime code path.
zh_hans: 选择与你当前运行时代码路径匹配的 Node.js 库。

source: Choose the React Native probe, Android debug trust XML, or Metro checklist that matches the target runtime.
zh_hans: 选择与目标运行时匹配的 React Native 探测、Android 调试信任 XML 或 Metro 检查清单。

source: Choose the read-only traffic scope
zh_hans: 选择只读流量范围

source: Choose the Ruby client that matches your current code path and copy the snippet.
zh_hans: 选择与当前代码路径匹配的 Ruby 客户端，然后复制代码片段。

source: Choose the snippet that matches your current runtime or library and copy it.
zh_hans: 选择与你当前运行时或库匹配的代码片段并复制。

source: Choose Two Transactions
zh_hans: 选择两个事务

source: Choose which built-in format tabs appear in the request and response inspectors.
zh_hans: 选择在请求和响应检查器中显示哪些内置格式标签页。

source: Choose which captured transactions to save in this HAR archive.
zh_hans: 选择要保存到此 HAR 文件中的已捕获事务。

source: Choose which eligible HTTP requests to use for the inferred OpenAPI document.
zh_hans: 选择要用于推断 OpenAPI 文档的合格 HTTP 请求。

source: Choose…
zh_hans: 选择…

source: Choosing an app adds the hosts it has contacted so far. Rules apply to those hosts for every client.
zh_hans: 选择一个 App 会添加它迄今连接过的主机。规则会对每个客户端的这些主机生效。

source: Chrome trusts user CAs, so loading an HTTPS page there confirms the proxy and certificate are wired correctly before you debug app traffic.
zh_hans: Chrome 信任用户 CA，因此在其中加载 HTTPS 页面可以确认代理和证书已正确连接，然后再调试 App 流量。

source: Clean up when debugging ends
zh_hans: 调试结束时清理

source: Clear
zh_hans: 清除

source: Clear All
zh_hans: 全部清除

source: Clear all protocol filters
zh_hans: 清除所有协议筛选条件

source: Clear all traffic-type and status filters
zh_hans: 清除所有流量类型和状态筛选器

source: Clear All...
zh_hans: 全部清除...

source: Clear captured requests and logs from this session across all tabs. ⌘K
zh_hans: 从所有标签页清除此会话中捕获的请求和日志。⌘K

source: Clear Compose History?
zh_hans: 清除 Compose 历史记录？

source: Clear console
zh_hans: 清除控制台

source: Clear Events
zh_hans: 清除事件

source: Clear Filters
zh_hans: 清除筛选条件

source: Clear History
zh_hans: 清除历史记录

source: Clear local comparison candidates
zh_hans: 清除本地比较候选项

source: Clear Runtime Events?
zh_hans: 清除运行时事件？

source: Clear search
zh_hans: 清除搜索

source: Clear search to reorder
zh_hans: 清除搜索以重新排序

source: Clear Session
zh_hans: 清除会话

source: Clear Session and Filters
zh_hans: 清除会话和过滤器

# Clear the %@ filter. %@
source: Clear the %1$@ filter. %2$@
zh_hans: 清除 %1$@ 筛选器。%2$@

source: Clear the active filters to show all captured traffic.
zh_hans: 清除当前筛选条件以显示所有捕获的流量。

source: Clear the current traffic session
zh_hans: 清除当前流量会话

source: CLI flag
zh_hans: CLI 标志

source: Click "+" or ⌘N to add new entry
zh_hans: 点按“+”或按 ⌘N 以添加新条目

source: Click "+" or press ⌘N to add a definition.
zh_hans: 点按“+”或按 ⌘N 以添加定义。

source: Click "+" or press ⌘N to create a profile.
zh_hans: 点按“+”或按 ⌘N 以创建配置。

source: Click "+" or press ⌘N to create a rule.
zh_hans: 点按“+”或按 ⌘N 创建规则。

source: Click "+" or press ⌘N to import a .proto file.
zh_hans: 点按“+”或按 ⌘N 以导入 .proto 文件。

source: Click + or create a rule from captured traffic.
zh_hans: 点击 + 或从捕获的流量创建规则。

source: Click + or press ⌘N to create a script.
zh_hans: 点按 + 或按 ⌘N 以创建脚本。

source: Click or drag to scroll body text
zh_hans: 点按或拖移以滚动正文文本

source: Click the L column on a candidate to finish this basic compare.
zh_hans: 点击候选项上的 L 列以完成此基本比较。

source: Click the R column on a candidate to finish this basic compare.
zh_hans: 点按候选项上的 R 列以完成此基础比较。

source: client
zh_hans: 客户端

source: Client
zh_hans: 客户端

source: Client App
zh_hans: 客户端 App

source: Client attribution reported by Rockxy.
zh_hans: Rockxy 报告的客户端归属信息。

source: Client Certificate Host
zh_hans: 客户端证书主机

source: Client Certificates
zh_hans: 客户端证书

source: Client configuration
zh_hans: 客户端配置

source: Client Configuration
zh_hans: 客户端配置

source: Close
zh_hans: 关闭

source: Close Tab
zh_hans: 关闭标签页

source: Close the matching client connection without a response.
zh_hans: 关闭匹配的客户端连接而不发送响应。

source: Closed
zh_hans: 已关闭

source: Auth
zh_hans: 认证

source: Certs
zh_hans: 证书

# Compact HTTP status code
source: Code
zh_hans: 状态码

source: Color
zh_hans: 颜色

source: Content Type
zh_hans: 内容类型

source: Cookies
zh_hans: Cookie

source: Custom
zh_hans: 自定义

source: Custom HTTP response status code
zh_hans: 自定义 HTTP 响应状态码

source: Debug
zh_hans: 调试

source: Document
zh_hans: 文档

source: Fault
zh_hans: 故障

source: Font
zh_hans: 字体

source: Form
zh_hans: 表单

source: Media
zh_hans: 媒体

source: Note
zh_hans: 备注

source: Notice
zh_hans: 通知

source: Other
zh_hans: 其他

source: Query String
zh_hans: 查询字符串

source: Request Header
zh_hans: 请求标头

source: Response Header
zh_hans: 响应标头

source: Status Code
zh_hans: 状态码

source: status unavailable
zh_hans: 状态不可用

source: Synopsis
zh_hans: 摘要

source: Timeline
zh_hans: 时间线

source: Traffic
zh_hans: 流量

source: Very Bad Network
zh_hans: 极差网络

source: Warning
zh_hans: 警告

source: Breakpoint edit error
zh_hans: 断点编辑错误

source: Closing active connections and restoring system routing.
zh_hans: 正在关闭活动连接并恢复系统路由。

source: Common HTTP response status
zh_hans: 常用 HTTP 响应状态码

source: Enter a valid HTTP URL with a host.
zh_hans: 请输入包含主机的有效 HTTP URL。

source: Enter a valid HTTP method.
zh_hans: 请输入有效的 HTTP 方法。

source: Enter a valid HTTP status code.
zh_hans: 请输入有效的 HTTP 状态码。

source: Enter a valid request path.
zh_hans: 请输入有效的请求路径。

source: Header names must use valid HTTP token characters.
zh_hans: 标头名称只能使用有效的 HTTP token 字符。

source: Header values cannot contain line breaks.
zh_hans: 标头值不能包含换行符。

source: Host, path, and query
zh_hans: 主机、路径和查询

source: Message editor section
zh_hans: 消息编辑器部分

source: Proxy shutdown is in progress
zh_hans: 正在关闭代理

source: Remove header
zh_hans: 移除标头

source: Remove query parameter
zh_hans: 移除查询参数

source: Restoring routing
zh_hans: 正在恢复路由

source: Stopping
zh_hans: 正在停止

source: Stopping Capture
zh_hans: 正在停止捕获

source: Stopping Proxy
zh_hans: 正在停止代理

source: Stopping…
zh_hans: 正在停止…

source: Rockxy is closing active connections and restoring system routing.
zh_hans: Rockxy 正在关闭活动连接并恢复系统路由。

source: The scheme is fixed for this cleartext connection
zh_hans: 此明文连接的协议已固定

source: Code beautified (indentation normalized).
zh_hans: 代码已美化（缩进已规范化）。

source: Code: %1$@ %2$@ contains %3$lld requests. Confirm the same code appears on %4$@. Your current Mac traffic will stay intact.
zh_hans: 代码：%1$@ %2$@ 包含 %3$lld 个请求。请确认 %4$@ 上显示相同的代码。当前 Mac 流量将保持不变。

source: Collapse %@
zh_hans: 折叠 %@

source: Collapse Rules
zh_hans: 折叠规则

source: Command
zh_hans: 命令

source: Command Bar
zh_hans: 命令栏

source: Command-line install remains manual
zh_hans: 命令行安装仍需手动完成

source: Common issues
zh_hans: 常见问题

source: Common Name
zh_hans: 通用名称

source: Compact general-purpose model for Apple silicon Macs
zh_hans: 适用于 Apple 芯片 Mac 的紧凑型通用模型

source: Compact multilingual reasoning model from Microsoft
zh_hans: 来自 Microsoft 的紧凑型多语言推理模型

source: Compare
zh_hans: 比较

source: Compare account, commitment/block tag, and result size across providers or retries.
zh_hans: 比较不同提供商或重试之间的账户、承诺/区块标签和结果大小。

source: Compare block tag, calldata, gas, and returned value before sending a transaction.
zh_hans: 发送交易前，请比较区块标签、calldata、gas 和返回值。

source: Compare call params, block tag, gas estimate, and revert message between attempts.
zh_hans: 比较各次尝试的调用参数、区块标签、Gas 估算和回滚消息。

source: Compare captured transactions or pasted text without modifying live traffic.
zh_hans: 比较捕获的事务或粘贴的文本，而不修改实时流量。

source: Compare model, tokens, finish reason, and latency against adjacent retries.
zh_hans: 请将模型、token、结束原因和延迟与相邻的重试进行比较。

source: Compare Selected
zh_hans: 比较所选

source: Compare Text
zh_hans: 比较文本

source: Compare the credential scheme and required scope without exposing the credential value.
zh_hans: 在不暴露凭据值的情况下比较凭据方案和所需范围。

source: Compare this with the last successful request.
zh_hans: 将此请求与上一个成功请求进行比较。

source: Compare two selected requests, then assign Left and Right in the comparison set.
zh_hans: 比较两个所选请求，然后在比较集中分配左侧和右侧。

source: Compare With Successful Request
zh_hans: 与成功的请求比较

source: Comparing…
zh_hans: 正在比较…

# Comparison limited to %lld of %lld lines · SHA-256 %@
source: Comparison limited to %1$lld of %2$lld lines · SHA-256 %3$@
zh_hans: 比较仅限前 %1$lld 行（共 %2$lld 行）· SHA-256 %3$@

source: Comparison limited to %1$lld of %2$lld lines and %3$lld of %4$lld UTF-8 bytes · SHA-256 %5$@
zh_hans: 比较限于 %2$lld 行中的 %1$lld 行和 %4$lld 个 UTF-8 字节中的 %3$lld 个 · SHA-256 %5$@

source: Comparison runs on your captured transactions and never modifies live traffic.
zh_hans: 比较只会针对捕获的事务运行，绝不会修改实时流量。

source: Comparison Set
zh_hans: 比较集

source: Comparison source
zh_hans: 比较来源

source: Comparison Source
zh_hans: 比较来源

source: Comparison target
zh_hans: 比较目标

source: Complete
zh_hans: 完成

source: Complete the matching rule and destination before saving.
zh_hans: 保存前请完成匹配规则和目标设置。

source: Complete the matching rule and local target before saving.
zh_hans: 保存前，请完成匹配规则和本地目标的设置。

source: Complete these four steps to prepare network debugging.
zh_hans: 完成这四个步骤以准备网络调试。

source: completed
zh_hans: 已完成

source: Completed
zh_hans: 已完成

source: Completed in %@
zh_hans: 在 %@ 内完成

source: Completion
zh_hans: 完成情况

source: Compose, replay, export, and sharing open a native review step.
zh_hans: Compose、重放、导出和共享操作都会打开原生审查步骤。

source: Compressed
zh_hans: 已压缩

source: Compressed Message
zh_hans: 压缩消息

source: CONDITIONS OFF
zh_hans: 条件已关闭

source: Configuration
zh_hans: 配置

source: Configure a provider and model in AI Assistant Settings
zh_hans: 在 AI 助手设置中配置提供商和模型

source: Configure Noise Control
zh_hans: 配置噪声控制

source: Configure reqwest to use Rockxy as the proxy and trust the exported root certificate.
zh_hans: 将 reqwest 配置为使用 Rockxy 作为代理，并信任导出的根证书。

source: Configure Rockxy as the local proxy and load the exported root certificate in your Go client.
zh_hans: 将 Rockxy 配置为本地代理，并在 Go 客户端中加载导出的根证书。

source: Configure the proxy on the emulator
zh_hans: 在模拟器上配置代理

source: Configured Content-Type, or the file-extension fallback.
zh_hans: 使用已配置的 Content-Type，或回退到文件扩展名。

source: Confirm provider adapter, response body visibility, and whether usage is omitted by this endpoint.
zh_hans: 确认提供商适配器、响应正文可见性，以及此端点是否省略用量信息。

source: Confirm the exact redacted traffic before it leaves this Mac.
zh_hans: 请在数据离开这台 Mac 前确认已脱敏流量的具体内容。

source: Confirm the redacted traffic and conversation before local inference begins.
zh_hans: 开始本地推理前，请确认已脱敏的流量和对话。

source: Confirm the redacted traffic and conversation before the model runs.
zh_hans: 模型运行前，请确认已脱敏的流量和对话。

source: Conflict
zh_hans: 冲突

source: Connect
zh_hans: 连接

source: Connect a GitHub account for Gist publishing.
zh_hans: 连接 GitHub 帐户以发布 Gist。

source: Connect compatible local clients to Rockxy over MCP.
zh_hans: 通过 MCP 将兼容的本地客户端连接到 Rockxy。

source: CONNECT opens a proxy tunnel
zh_hans: CONNECT 会打开代理隧道

source: CONNECT requests cannot be replayed from Compose.
zh_hans: 无法从 Compose 重放 CONNECT 请求。

source: Connect this Mac to Wi-Fi or Ethernet to expose a reachable LAN IP.
zh_hans: 将这台 Mac 连接到 Wi-Fi 或以太网，以获取可访问的局域网 IP。

# Connected to %@ at %@ with %@.
source: Connected to %1$@ at %2$@ with %3$@.
zh_hans: 已连接到 %1$@，位于 %2$@，使用 %3$@。

# Connected to %@:%lld through %@ in %lld ms.
source: Connected to %1$@:%2$lld through %3$@ in %4$lld ms.
zh_hans: 已通过 %3$@ 在 %4$lld 毫秒内连接到 %1$@:%2$lld。

source: Connecting to Ollama…
zh_hans: 正在连接 Ollama…

source: Connecting to the local service at %@.
zh_hans: 正在连接 %@ 上的本地服务。

source: Connection
zh_hans: 连接

source: Connection check cancelled.
zh_hans: 连接检查已取消。

source: Console entries exist, but the active level filter hides them all.
zh_hans: 存在控制台条目，但当前级别过滤器将其全部隐藏。

source: Container command
zh_hans: 容器命令

source: Contains
zh_hans: 包含

source: Content
zh_hans: 内容

source: Content Not Inspected
zh_hans: 内容未检查

source: Content Security Policy header
zh_hans: Content Security Policy 标头

source: Content Transfer
zh_hans: 内容传输

source: Content transfer dominates
zh_hans: 内容传输耗时占主导

source: Context Dock
zh_hans: 上下文停靠栏

source: Context Window
zh_hans: 上下文窗口

source: Context window tokens
zh_hans: 上下文窗口 token 数

source: Continue
zh_hans: 继续

source: Continue All Original
zh_hans: 全部按原样继续

source: Continue Original
zh_hans: 继续原始流量

source: Conversation History
zh_hans: 对话历史记录

source: Conversation name
zh_hans: 对话名称

source: Conversation traffic changed
zh_hans: 对话流量已更改

source: Conversations
zh_hans: 对话

source: Cookie header
zh_hans: Cookie 标头

source: Cookie values remain hidden.
zh_hans: Cookie 值保持隐藏。

source: Cookie-based credentials may be present
zh_hans: 可能存在基于 Cookie 的凭据

source: Copied
zh_hans: 已复制

source: Copied.
zh_hans: 已复制。

source: Copy
zh_hans: 复制

source: Copy App Name
zh_hans: 复制 App 名称

source: Copy as
zh_hans: 复制为

source: Copy as cURL
zh_hans: 拷贝为 cURL

source: Copy Body
zh_hans: 复制正文

source: Copy Cell Value
zh_hans: 复制单元格值

source: Copy Command
zh_hans: 复制命令

source: Copy cURL
zh_hans: 复制 cURL

source: Copy Debug Info…
zh_hans: 拷贝调试信息…

source: Copy Details
zh_hans: 复制详情

source: Copy Domain
zh_hans: 复制域名

source: Copy Gist URL to clipboard
zh_hans: 将 Gist URL 复制到剪贴板

source: Copy Header Name
zh_hans: 复制标头名称

source: Copy Header Value
zh_hans: 复制标头值

source: Copy Name: Value
zh_hans: 复制名称: 值

source: Copy of %@
zh_hans: %@ 的副本

source: Copy pairing token
zh_hans: 复制配对令牌

source: Copy Path Filter
zh_hans: 复制路径过滤器

source: Copy Setup Command
zh_hans: 复制设置命令

source: Copy Snippet
zh_hans: 复制代码片段

source: Copy the Rockxy PEM into the emulator and install it as a user CA under Settings > Security > Encryption & credentials.
zh_hans: 将 Rockxy PEM 复制到模拟器中，然后在“设置 > 安全 > 加密与凭据”下将其安装为用户 CA。

source: Copy the Rockxy PEM to the device and install it under Settings > Security > Encryption & credentials > Install a certificate > CA certificate.
zh_hans: 将 Rockxy PEM 复制到设备，并在设置 > 安全 > 加密与凭据 > 安装证书 > CA 证书中安装。

source: Copy the selected request as a cURL command. ⇧⌘C
zh_hans: 将所选请求复制为 cURL 命令。⇧⌘C

source: Copy this JSON into a compatible client's MCP configuration.
zh_hans: 将此 JSON 复制到兼容客户端的 MCP 配置中。

source: Copy URL
zh_hans: 复制 URL

# Could not %@: %@
source: Could not %1$@: %2$@
zh_hans: 无法%1$@：%2$@

source: Could not build the certificate sharing URL. Try again.
zh_hans: 无法构建证书共享 URL。请重试。

source: Could not create a secure certificate sharing token. Try again.
zh_hans: 无法创建安全的证书共享令牌。请重试。

source: Could not create export data. %@
zh_hans: 无法创建导出数据。 %@

source: Could not create HAR data. %@
zh_hans: 无法创建 HAR 数据。 %@

source: Could not create the script. %@
zh_hans: 无法创建脚本。%@

source: Could not decode the %@ segment as Base64URL.
zh_hans: 无法将 %@ 段解码为 Base64URL。

source: Could not delete the script, and Rockxy could not restore its runtime. %@
zh_hans: 无法删除脚本，Rockxy 也无法恢复其运行时。%@

source: Could not delete the script. %@
zh_hans: 无法删除脚本。%@

source: Could not duplicate the script. %@
zh_hans: 无法复制脚本。%@

source: Could not enable the script. %@
zh_hans: 无法启用脚本。%@

source: Could not export HAR file. %@
zh_hans: 无法导出 HAR 文件。 %@

# Could not import "%@". %@
source: Could not import "%1$@". %2$@
zh_hans: 无法导入 “%1$@”。 %2$@

# Could not import "%@". The file may not be a valid HAR archive. %@
source: Could not import "%1$@". The file may not be a valid HAR archive. %2$@
zh_hans: 无法导入 “%1$@”。 该文件可能不是有效的 HAR 文件。%2$@

source: Could not prepare the setup script: %@
zh_hans: 无法准备设置脚本：%@

# Could not read "%@". %@
source: Could not read "%1$@". %2$@
zh_hans: 无法读取 “%1$@”。 %2$@

source: Could not read file: %@
zh_hans: 无法读取文件：%@

source: Could not save HAR file. %@
zh_hans: 无法保存 HAR 文件。 %@

source: Could not save Projects
zh_hans: 无法保存项目

source: Could not serialize session data. %@
zh_hans: 无法序列化会话数据。 %@

source: Could not start the temporary certificate sharing server. Try again.
zh_hans: 无法启动临时证书共享服务器。请重试。

source: Could not write export file. %@
zh_hans: 无法写入导出文件。 %@

source: Could not write session file. %@
zh_hans: 无法写入会话文件。 %@

source: Country or Region
zh_hans: 国家或地区

source: Create
zh_hans: 创建

source: Create a reusable %@ message.
zh_hans: 创建可重复使用的 %@ 消息。

source: Create a reusable app, domain, or path scope.
zh_hans: 创建可重复使用的 App、域名或路径范围。

source: Create Allow List Rule…
zh_hans: 创建允许列表规则…

source: Create and trust Rockxy's root certificate from the Mac Setup Guide before intercepting HTTPS.
zh_hans: 拦截 HTTPS 前，请先通过 Mac 设置指南创建并信任 Rockxy 根证书。

source: Create Focus Set
zh_hans: 创建焦点集

source: Create Rockxy's local certificate authority for HTTPS inspection.
zh_hans: 创建 Rockxy 的本地证书颁发机构，用于检查 HTTPS。

source: Create Rule
zh_hans: 创建规则

source: Create Rule from Request
zh_hans: 从请求创建规则

source: Create Token
zh_hans: 创建令牌

# Created from %@ %@
source: Created from %1$@ %2$@
zh_hans: 创建自 %1$@ %2$@

# Created from %@ %@%@
source: Created from %1$@ %2$@%3$@
zh_hans: 创建自 %1$@ %2$@%3$@

source: Created from domain %@
zh_hans: 从域名 %@ 创建

source: Created from domain: %@
zh_hans: 创建自域名：%@

# Created from: %@ %@%@
source: Created from: %1$@ %2$@%3$@
zh_hans: 创建自：%1$@ %2$@%3$@

# Created from: %@%@
source: Created from: %1$@%2$@
zh_hans: 创建自：%1$@%2$@

source: Credential
zh_hans: 凭据

source: Credential rejection or insufficient scope is likely
zh_hans: 可能是凭据被拒绝或权限范围不足

source: Cross-Origin Resource Sharing header
zh_hans: 跨源资源共享标头

source: Curated Local Models
zh_hans: 精选本地模型

source: cURL command
zh_hans: cURL 命令

source: Current
zh_hans: 当前

source: Current issue
zh_hans: 当前问题

source: Current limitation
zh_hans: 当前限制

source: Current Status
zh_hans: 当前状态

source: Current Traffic Tab
zh_hans: 当前流量标签页

source: Current:
zh_hans: 当前：

source: Custom & Local
zh_hans: 自定义与本地

source: Custom Certificate Failed
zh_hans: 自定义证书失败

source: Custom Certificates
zh_hans: 自定义证书

source: Custom Header Columns
zh_hans: 自定义标头列

source: Custom Header Columns…
zh_hans: 自定义标头列…

source: Custom latency
zh_hans: 自定义延迟

source: Custom Latency
zh_hans: 自定义延迟

source: Custom latency must be greater than 0 ms.
zh_hans: 自定义延迟必须大于 0 ms。

source: Custom model from the Ollama library
zh_hans: 来自 Ollama 库的自定义模型

source: Custom Root Active
zh_hans: 自定义根证书已启用

source: Custom Root Unavailable
zh_hans: 自定义根证书不可用

source: Customize Quick Tools
zh_hans: 自定义快捷工具

source: Customize Quick Tools…
zh_hans: 自定义快捷工具…

source: Customize Toolbar…
zh_hans: 自定义工具栏…

source: Daily
zh_hans: 每天

source: Dark
zh_hans: 深色

source: Data Handling
zh_hans: 数据处理

source: Data Storage
zh_hans: 数据存储

source: Debug Focus
zh_hans: 调试焦点

source: Debug Intent
zh_hans: 调试意图

source: Debug My App…
zh_hans: 调试我的应用…

source: Decision
zh_hans: 决策

source: Decline
zh_hans: 拒绝

source: Decode
zh_hans: 解码

source: Decode Base64
zh_hans: 解码 Base64

source: Decode JWT
zh_hans: 解码 JWT

source: Decoded Base64
zh_hans: 已解码的 Base64

source: Decoded only. Signature not verified.
zh_hans: 仅已解码。签名未经验证。

source: Decoded Payload
zh_hans: 已解码的有效载荷

source: Decrypt App
zh_hans: 解密 App

source: Decrypt Host
zh_hans: 解密主机

source: Decrypt HTTPS
zh_hans: 解密 HTTPS

source: Decrypt rules apply to new HTTPS connections. Tunnel rules take priority on overlaps; row order does not affect matching.
zh_hans: 解密规则适用于新的 HTTPS 连接。重叠时隧道规则优先；行顺序不影响匹配。

source: DECRYPTION READY
zh_hans: 解密就绪

source: Decryption retry is ready for %@. Repeat the request or reconnect the app.
zh_hans: %@ 的解密重试已就绪。请重复该请求或重新连接应用。

source: Decryption Was Declined
zh_hans: 解密被拒绝

source: Defaults for built-in debugging tools.
zh_hans: 内置调试工具的默认设置。

source: Delay (ms)
zh_hans: 延迟（毫秒）

source: Delete
zh_hans: 删除

source: Delete %@
zh_hans: 删除 %@

source: Delete Certificate?
zh_hans: 删除证书？

source: Delete Conversation
zh_hans: 删除对话

source: Delete Definition
zh_hans: 删除定义

source: Delete Folder
zh_hans: 删除文件夹

source: Delete Folder?
zh_hans: 删除文件夹？

source: Delete Preset
zh_hans: 删除预设

source: Delete Project
zh_hans: 删除项目

source: Delete Project?
zh_hans: 删除项目？

source: Delete Protobuf Schema
zh_hans: 删除 Protobuf 架构

source: Delete Rule
zh_hans: 删除规则

source: Delete Schema?
zh_hans: 删除架构？

source: Delete Script
zh_hans: 删除脚本

source: Delete Script?
zh_hans: 删除脚本？

source: Delete Selected
zh_hans: 删除所选项

source: Delete selected Breakpoint rule
zh_hans: 删除所选断点规则

source: Delete selected local Protobuf schema
zh_hans: 删除选定的本地 Protobuf 架构

source: Delete selected mapping definition
zh_hans: 删除所选映射定义

source: Delete selected Modify Header rule
zh_hans: 删除所选的修改标头规则

source: Delete selected template
zh_hans: 删除所选模板

source: Delete Template
zh_hans: 删除模板

source: Delete Template?
zh_hans: 删除模板？

source: Delete this conversation?
zh_hans: 删除此对话？

source: Delete…
zh_hans: 删除…

source: Deleted schema and cleared %lld references.
zh_hans: 已删除架构并清除 %lld 个引用。

source: Deleted schema.
zh_hans: 架构已删除。

source: Deleting…
zh_hans: 正在删除…

source: Delimited List
zh_hans: 分隔列表

source: Deliver the PEM to the device, install it as a profile, then enable full trust under the certificate trust settings.
zh_hans: 将 PEM 传送到设备并安装为描述文件，然后在证书信任设置中启用完全信任。

source: Derived
zh_hans: 派生

source: Deselect All
zh_hans: 取消全选

source: Destination
zh_hans: 目标

source: Destination fields filled.
zh_hans: 目标字段已填写。

source: Destination host
zh_hans: 目标主机

source: Destination path
zh_hans: 目标路径

source: Destination port
zh_hans: 目标端口

source: Destination protocol
zh_hans: 目标协议

source: Destination query
zh_hans: 目标查询

source: Detach Inspector
zh_hans: 分离检查器

source: Detail
zh_hans: 详情

source: Detailed phase timing unavailable
zh_hans: 详细阶段时序不可用

source: Details
zh_hans: 详细信息

source: Detected
zh_hans: 已检测到

source: Dev Hub
zh_hans: 开发者中心

source: Developer Hub
zh_hans: 开发者中心

source: Developer Setup
zh_hans: 开发者设置

source: Developer setup needed
zh_hans: 需要开发者设置

source: Developer setup targets
zh_hans: 开发者设置目标

source: Developer Setup walks you through pointing a runtime, browser, or device at Rockxy's proxy and verifying traffic flows.
zh_hans: 开发者设置会引导你将运行时、浏览器或设备指向 Rockxy 的代理，并验证流量是否正常传输。

source: Developer Setup…
zh_hans: 开发者设置…

source: Device certificate
zh_hans: 设备证书

source: Device Endpoint
zh_hans: 设备端点

source: Device proxy unreachable
zh_hans: 无法访问设备代理

source: Devices
zh_hans: 设备

source: Devices outside this Mac cannot reach localhost-only mode. Turn off Only Listen on localhost, then restart the proxy.
zh_hans: 这台 Mac 之外的设备无法访问“仅监听本地主机”模式。请关闭“仅监听本地主机”，然后重启代理。

source: Diagnose system routing and configure how the proxy listens.
zh_hans: 诊断系统路由并配置代理的监听方式。

source: Diagnostics, updates, and lower-level proxy controls.
zh_hans: 诊断、更新和更底层的代理控制。
